app/controllers/authentications_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "bob@bob.com"], ["password_digest", "$2a$10$sCswC0rb2EfRxO21e7.3FuhMY1qFZ7mDcT8OXjpB.cU9cmcuUY1O."], ["created_at", 2016-10-27 15:15:26 UTC], ["updated_at", 2016-10-27 15:15:26 UTC]]
---
  def register
    user = User.new(user_params)
    if user.save