app/controllers/events_controller.rb

  def create
    @event = @current_user.enquiries.new(event_params)
    @event.plumber = @plumber

    if @event.save
---
INSERT INTO "events" ("startsAt", "endsAt", "client_id", "plumber_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["startsAt", Sat, 29 Oct 2016], ["endsAt", Sat, 29 Oct 2016], ["client_id", 2], ["plumber_id", 1], ["created_at", 2016-10-26 11:10:29 UTC], ["updated_at", 2016-10-26 11:10:29 UTC]]

    def set_plumber
      @plumber = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]